/**********************************************************************************************************
** 文件名: 		Run_Led_Driver.h
** 版本：  		1.0
** 工作环境: 	RealView MDK-ARM 5.11
** 作者: 		盖书永
** 生成日期: 	2014年11月17日19:26:43
** 功能:		运行指示灯驱动
** 相关文件:					
** 修改日志：	 
**********************************************************************************************************/ 
#ifndef __RUN_LED_DRIVER_H
#define __RUN_LED_DRIVER_H

#define RUN_LED_ON 		do {  	\
    GPIOA->BSRRL = GPIO_Pin_12;	\
    GPIOB->BSRRL = GPIO_Pin_2; 	\
}while(0)

#define RUN_LED_OFF 	do {  	\
    GPIOA->BSRRH = GPIO_Pin_12;	\
    GPIOB->BSRRH = GPIO_Pin_2; 	\
}while(0)	

/**********************************************************************************************************
* 函数名称： void Run_Led_Init(void)
* 函数说明： 运行指示灯引脚初始化
* 输入参数： 无
* 返回参数： 无
**********************************************************************************************************/
void Run_Led_Init(void);

#endif
