/*******************************************************************************
** 文件名: 		SysTick_Driver.h
** 版本：  		1.0
** 工作环境: 	RealView MDK-ARM 5.11
** 作者: 		盖书永
** 生成日期: 	2014年11月17日19:26:43
** 功能:		系统滴答驱动
** 相关文件:					
** 修改日志： 
*******************************************************************************/ 
#ifndef __SYSTICK_DRIVER_H
#define __SYSTICK_DRIVER_H

/*******************************************************************************
* 函数名称： void SysTick_Init(void)
* 函数说明： 系统滴答初始化
* 输入参数： 无
* 返回参数： 无
*******************************************************************************/
void SysTick_Init(void);

#endif
