/**********************************************************************************
** 文件名: 		NVIC_Config.h
** 版本：  		1.0
** 工作环境: 	RealView MDK-ARM 4.20
** 作者: 		盖书永
** 生成日期: 	2012-09-20
** 功能:		硬件中断优先级分组方式，中断优先级，使能配置
** 相关文件:	无
** 修改日志：	 
**********************************************************************************/
#ifndef NVIC_Config_H
#define NVIC_Config_H
/*********************************************************************************
* 函数名称:	 void NVIC_Configuration(void)
* 函数说明： 中断优先级分组方式，中断优先级，使能配置
* 输入参数： 无
* 返回参数： 无
**********************************************************************************/
void NVIC_Configuration(void);
#endif
